refactor:melhorias nas Docs/Readme
